# Housing Costs and Inflation
## Housing Data Wrangling

### Importations

In [1]:
# Import Libraries

import pandas as pd
import numpy as np
import os

In [18]:
# Set Path

path = r'C:\Users\calli\OneDrive\Desktop\School\Career Foundry\Data Immersion\Achievement 6'

In [20]:
# Import excel file

df_H = pd.read_excel(os.path.join(path, '02 Data', 'Prepared Data', 'Realtor_Data_Cleaned.xlsx'), index_col = False)

### Descriptive Statistics

In [28]:
# Show Head

df_H.head()

,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,3,2,0.12,Adjuntas,Puerto Rico,601,920,NaT,105000
1,4,2,0.08,Adjuntas,Puerto Rico,601,1527,NaT,80000
2,2,1,0.15,Juana Diaz,Puerto Rico,795,748,NaT,67000
3,4,2,0.10,Ponce,Puerto Rico,731,1800,NaT,145000
4,4,3,0.46,San Sebastian,Puerto Rico,612,2520,NaT,179000

In [29]:
# Show shape

df_H.shape

(413083, 9)

In [21]:
# Show Statistics formatted to easily read numbers

df_H.describe().apply(lambda s: s.apply('{0:.2f}'.format))

,bed,bath,acre_lot,zip_code,house_size,prev_sold_date,price
count,413083.00,413083.00,413083.00,413083.00,413083.00,226626.00,413083.00
mean,3.81,2.69,9.56,5757.73,2403.08,.2f,773913.69
min,1.00,1.00,0.00,601.00,122.00,.2f,500.00
25%,3.00,2.00,0.11,2467.00,1330.00,.2f,280000.00
50%,3.00,2.00,0.26,5681.00,1890.00,.2f,450000.00
75%,4.00,3.00,0.88,8041.00,2770.00,.2f,779000.00
max,99.00,198.00,100000.00,95652.00,1450112.00,.2f,169000000.00
std,2.18,2.23,640.33,4073.13,3308.14,nan,1470700.49

In [22]:
# Show Statistics

df_H.describe()

,bed,bath,acre_lot,zip_code,house_size,prev_sold_date,price
count,413083.000000,413083.000000,413083.000000,413083.000000,4.130830e+05,226626,4.130830e+05
mean,3.813183,2.692861,9.564810,5757.732761,2.403078e+03,2008-01-04 00:31:24.493394432,7.739137e+05
min,1.000000,1.000000,0.000000,601.000000,1.220000e+02,1901-01-01 00:00:00,5.000000e+02
25%,3.000000,2.000000,0.110000,2467.000000,1.330000e+03,2001-06-29 00:00:00,2.800000e+05
50%,3.000000,2.000000,0.260000,5681.000000,1.890000e+03,2008-04-01 00:00:00,4.500000e+05
75%,4.000000,3.000000,0.880000,8041.000000,2.770000e+03,2017-04-28 00:00:00,7.790000e+05
max,99.000000,198.000000,100000.000000,95652.000000,1.450112e+06,2023-03-01 00:00:00,1.690000e+08
std,2.180268,2.232729,640.326835,4073.133511,3.308144e+03,NaN,1.470700e+06

### Consistency Checks

In [25]:
# Check for mixed data types

for col in df_H.columns.tolist():
  weird = (df_H[[col]].applymap(type) != df_H[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_H[weird]) > 0:
    print (col)

prev_sold_date

In [26]:
# Check for missing values

df_H.isnull().sum()

bed                    0
bath                   0
acre_lot               0
city                   0
state                  0
zip_code               0
house_size             0
prev_sold_date    186457
price                  0
dtype: int64

In [32]:
# Create view of homes with previous sale date

df_H_old = df_H[df_H['prev_sold_date'].isnull() == False]

In [33]:
# Show df_H_old head

df_H_old.head()

,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
534,7,3,0.09,Dorado,Puerto Rico,949,1192,2019-06-28,110000
2131,7,3,0.09,Dorado,Puerto Rico,949,1192,2019-06-28,110000
3217,7,3,0.09,Dorado,Puerto Rico,949,1192,2019-06-28,110000
3392,7,3,0.09,Dorado,Puerto Rico,949,1192,2019-06-28,110000
5773,7,3,0.09,Dorado,Puerto Rico,949,1192,2019-06-28,110000

In [34]:
# Show df_H_old shape

df_H_old.shape

(226626, 9)

In [36]:
# Create view of homes without previous sale date

df_H_new = df_H[df_H['prev_sold_date'].isnull() == True]

In [37]:
# Show df_H_new head

df_H_new.head()

,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
0,3,2,0.12,Adjuntas,Puerto Rico,601,920,NaT,105000
1,4,2,0.08,Adjuntas,Puerto Rico,601,1527,NaT,80000
2,2,1,0.15,Juana Diaz,Puerto Rico,795,748,NaT,67000
3,4,2,0.10,Ponce,Puerto Rico,731,1800,NaT,145000
4,4,3,0.46,San Sebastian,Puerto Rico,612,2520,NaT,179000

In [38]:
# Show df_H_old shape

df_H_new.shape

(186457, 9)

In [39]:
# Check for duplicates

df_dups = df_H[df_H.duplicated()]

In [41]:
# Show duplicates

df_dups

,bed,bath,acre_lot,city,state,zip_code,house_size,prev_sold_date,price
83,3,2,0.08,Ponce,Puerto Rico,728,1500,NaT,105000
87,5,3,7.46,Las Marias,Puerto Rico,670,5403,NaT,300000
88,3,2,0.10,Lares,Puerto Rico,669,4161,NaT,155000
94,3,2,0.05,Yauco,Puerto Rico,698,1118,NaT,122500
95,3,2,3.88,San Sebastian,Puerto Rico,685,4000,NaT,575000
...,...,...,...,...,...,...,...,...,...
413049,6,6,0.30,Bronxville,New York,10708,3897,2014-08-21,2850000
413050,3,3,0.35,White Plains,New York,10605,2267,NaT,774000
413052,5,2,0.11,Mount Vernon,New York,10553,2217,2001-02-20,675000
413054,4,3,0.05,Bronx,New York,10466,1260,1997-05-20,700000
413056,3,4,1.63,Armonk,New York,10504,2688,1996-05-21,1475000

In [42]:
# Check difference between df_H and df_dups

413083-361123

51960

In [43]:
# Drop duplicate rows from full dataframe

df_H_no_dups = df_H.drop_duplicates()

In [44]:
# Show df_H_no_dups shape

df_H_no_dups.shape

(51960, 9)

In [45]:
# Drop duplicate rows from view of homes without previous sale date

df_H_new_no_dups = df_H_new.drop_duplicates()

In [46]:
# Drop duplicate rows from view of homes with previous sale date

df_H_old_no_dups = df_H_old.drop_duplicates()

In [48]:
# Show df_H_new_no_dups shape

df_H_new_no_dups.shape

(20123, 9)

In [49]:
# Show df_H_old_no_dups shape

df_H_old_no_dups.shape

(31837, 9)

### Exportations

In [50]:
# Export Dataframe df_H_new_no_dups as Realtor_Wrangled_New_Homes into csv file

df_H_new_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'Realtor_Wrangled_New_Homes.csv'))

In [51]:
# Export Dataframe df_H_old_no_dups as Realtor_Wrangled_Old_Homes into csv file

df_H_old_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'Realtor_Wrangled_Old_Homes.csv'))

In [52]:
# Export Dataframe df_H_no_dups as Realtor_Wrangled_Full into csv file

df_H_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'Realtor_Wrangled_Full.csv'))